# Taps（Homebrew 的软件源扩展，允许安装更多软件）
tap 'homebrew/cask-fonts'      # 提供各种字体的安装
tap 'homebrew/cask-versions'   # 提供应用的不同版本（如测试版、旧版等）
tap 'stripe/stripe-cli'        # Stripe 官方命令行工具的源

# Binaries
brew 'bash'           # 最新版 Bash shell，macOS 自带的版本较旧
brew 'coreutils'      # GNU 核心工具集，macOS 自带的版本较旧
brew 'git'            # 版本控制工具 Git
brew 'grep'           # 文本搜索工具，GNU 版本功能更强
brew 'httpie'         # 友好的 HTTP 命令行客户端，类似 curl
brew 'jq'             # 处理 JSON 的命令行工具，常用于数据处理
brew 'mas'            # Mac App Store 命令行管理工具，用于安装和管理 Mac App Store 应用 https://github.com/mas-cli/mas

# 多媒体文件处理
brew 'jpegoptim'   # 图片压缩优化工具
brew 'optipng'     # PNG 图片优化工具
brew 'pngquant'    # PNG 图片有损压缩工具
brew 'ffmpeg'         # 音视频处理工具，支持格式转换、剪辑等
brew 'imagemagick'    # 图像处理工具，支持多种格式的转换、编辑和合成

# Apps
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'imageoptim'
cask 'visual-studio-code'
cask 'dbeaver-community'
cask 'clash-verge-rev'
cask 'snipaste'
cask 'apifox'
cask 'raycast'
cask 'rectangle'
cask 'another-redis-desktop-manager'
cask 'navi'
cask 'folx' #下载工具
cask 'pronotes'
cask 'stats'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store https://github.com/mas-cli/mas
mas 'Giphy Capture', id: 668208984    # Giphy Capture：屏幕录制生成 GIF 动画
mas 'RunCat', id: 1429033973
mas '企业微信', id: 1189898970
mas '微信', id: 836500024
mas '网易云音乐', id: 944848654
mas '高德地图', id: 461703208
